# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import warnings; warnings.simplefilter('ignore')
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [3]:
#Your code here
cur.execute('''SELECT firstName, lastName FROM employees e
            JOIN offices o
            USING (officeCode)
            WHERE city = 'Boston';''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
#Your code here
cur.execute('''SELECT city, COUNT(*) FROM offices
            LEFT JOIN employees
            USING (officeCode)
            GROUP BY city;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

            city  COUNT(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Write 3 Questions of your own and answer them

In [8]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [63]:
# How many customers has each employee dealt with?
cur.execute('''SELECT firstName, lastName, COUNT(customerName) as total_customers FROM employees e
            LEFT JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            GROUP BY employeeNumber
            ORDER BY total_customers DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName  lastName  total_customers
0    Pamela  Castillo               10
1     Barry     Jones                9
2    George    Vanauf                8
3     Larry      Bott                8
4  Foon Yue     Tseng                7

In [64]:
# How many orders has each customer placed, and for how much?
cur.execute('''SELECT customerName, COUNT(orderNumber) AS total_orders, SUM(amount) as total_amount
            FROM customers c
            LEFT JOIN orders
            USING (customerNumber)
            LEFT JOIN payments
            USING (customerNumber)
            GROUP BY customerNumber
            ORDER BY total_orders DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                   customerName  total_orders  total_amount
0        Euro+ Shopping Channel           338   18609213.48
1  Mini Gifts Distributors Ltd.           153    9931200.08
2    Australian Collectors, Co.            20     902925.35
3      Danish Wholesale Imports            20     537232.50
4       Dragon Souveniers, Ltd.            20     781255.15

In [70]:
# Which city as a whole has the best sale amount?
cur.execute('''SELECT o.city, SUM(amount) as total_amount
            FROM payments p
            LEFT JOIN customers c
            USING (customerNumber)
            LEFT JOIN employees e
            ON c.salesRepEmployeeNumber = e.employeeNumber
            LEFT JOIN offices o
            USING (officeCode)
            GROUP BY o.city
            ORDER BY total_amount DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(1)

    city  total_amount
0  Paris     2819168.9

## Level Up: Display the names of every individual product that each employee has sold

In [74]:
# Your code here
cur.execute('''SELECT firstName, lastName, productName
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders o
            USING (customerNumber)
            JOIN orderdetails
            USING (orderNumber)
            JOIN products
            USING (productCode);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [76]:
# Your code here
cur.execute('''SELECT firstName, lastName, COUNT(productName) as total_products_sold
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders o
            USING (customerNumber)
            JOIN orderdetails
            USING (orderNumber)
            JOIN products
            USING (productCode)
            GROUP BY firstName, lastName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName  total_products_sold
0      Andy     Fixter                  185
1     Barry      Jones                  220
2  Foon Yue      Tseng                  142
3    George     Vanauf                  211
4    Gerard  Hernandez                  396

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!